{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "data", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "data"}, "inbound_nodes": []}, {"name": "bn_data", "class_name": "BatchNormalization", "config": {"name": "bn_data", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "zero_padding2d", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"name": "conv0", "class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "relu0", "class_name": "Activation", "config": {"name": "relu0", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"name": "pooling0", "class_name": "MaxPooling2D", "config": {"name": "pooling0", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "stage1_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"name": "stage1_unit1_relu1", "class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "stage1_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage1_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "stage1_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"name": "stage1_unit1_relu2", "class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"name": "stage1_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage1_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "stage1_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage1_unit1_sc", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"name": "stage1_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add", 0, 0, {}]]]}, {"name": "stage1_unit2_relu1", "class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"name": "stage1_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage1_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "stage1_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu2", "class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"name": "stage1_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage1_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add", 0, 0, {}]]]}, {"name": "stage2_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "stage2_unit1_relu1", "class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "stage2_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage2_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "stage2_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"name": "stage2_unit1_relu2", "class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"name": "stage2_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage2_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "stage2_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage2_unit1_sc", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"name": "stage2_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "stage2_unit2_relu1", "class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"name": "stage2_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage2_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "stage2_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"name": "stage2_unit2_relu2", "class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"name": "stage2_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage2_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"name": "stage3_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "stage3_unit1_relu1", "class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "stage3_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage3_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "stage3_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"name": "stage3_unit1_relu2", "class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"name": "stage3_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage3_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "stage3_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage3_unit1_sc", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"name": "stage3_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "stage3_unit2_relu1", "class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_12", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"name": "stage3_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage3_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"name": "stage3_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"name": "stage3_unit2_relu2", "class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_13", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"name": "stage3_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage3_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"name": "stage4_unit1_bn1", "class_name": "BatchNormalization", "config": {"name": "stage4_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "stage4_unit1_relu1", "class_name": "Activation", "config": {"name": "stage4_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_14", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"name": "stage4_unit1_conv1", "class_name": "Conv2D", "config": {"name": "stage4_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"name": "stage4_unit1_bn2", "class_name": "BatchNormalization", "config": {"name": "stage4_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"name": "stage4_unit1_relu2", "class_name": "Activation", "config": {"name": "stage4_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"name": "stage4_unit1_conv2", "class_name": "Conv2D", "config": {"name": "stage4_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "stage4_unit1_sc", "class_name": "Conv2D", "config": {"name": "stage4_unit1_sc", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"name": "stage4_unit2_bn1", "class_name": "BatchNormalization", "config": {"name": "stage4_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "stage4_unit2_relu1", "class_name": "Activation", "config": {"name": "stage4_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_16", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"name": "stage4_unit2_conv1", "class_name": "Conv2D", "config": {"name": "stage4_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"name": "stage4_unit2_bn2", "class_name": "BatchNormalization", "config": {"name": "stage4_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"name": "stage4_unit2_relu2", "class_name": "Activation", "config": {"name": "stage4_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_17", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"name": "stage4_unit2_conv2", "class_name": "Conv2D", "config": {"name": "stage4_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "relu1", "class_name": "Activation", "config": {"name": "relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"name": "decoder_stage0_upsampling", "class_name": "UpSampling2D", "config": {"name": "decoder_stage0_upsampling", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"name": "decoder_stage0_concat", "class_name": "Concatenate", "config": {"name": "decoder_stage0_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["decoder_stage0_upsampling", 0, 0, {}], ["stage4_unit1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage0a_conv", "class_name": "Conv2D", "config": {"name": "decoder_stage0a_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage0_concat", 0, 0, {}]]]}, {"name": "decoder_stage0a_bn", "class_name": "BatchNormalization", "config": {"name": "decoder_stage0a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage0a_conv", 0, 0, {}]]]}, {"name": "decoder_stage0a_relu", "class_name": "Activation", "config": {"name": "decoder_stage0a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["decoder_stage0a_bn", 0, 0, {}]]]}, {"name": "decoder_stage0b_conv", "class_name": "Conv2D", "config": {"name": "decoder_stage0b_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage0a_relu", 0, 0, {}]]]}, {"name": "decoder_stage0b_bn", "class_name": "BatchNormalization", "config": {"name": "decoder_stage0b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage0b_conv", 0, 0, {}]]]}, {"name": "decoder_stage0b_relu", "class_name": "Activation", "config": {"name": "decoder_stage0b_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["decoder_stage0b_bn", 0, 0, {}]]]}, {"name": "decoder_stage1_upsampling", "class_name": "UpSampling2D", "config": {"name": "decoder_stage1_upsampling", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["decoder_stage0b_relu", 0, 0, {}]]]}, {"name": "decoder_stage1_concat", "class_name": "Concatenate", "config": {"name": "decoder_stage1_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["decoder_stage1_upsampling", 0, 0, {}], ["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage1a_conv", "class_name": "Conv2D", "config": {"name": "decoder_stage1a_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage1_concat", 0, 0, {}]]]}, {"name": "decoder_stage1a_bn", "class_name": "BatchNormalization", "config": {"name": "decoder_stage1a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage1a_conv", 0, 0, {}]]]}, {"name": "decoder_stage1a_relu", "class_name": "Activation", "config": {"name": "decoder_stage1a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["decoder_stage1a_bn", 0, 0, {}]]]}, {"name": "decoder_stage1b_conv", "class_name": "Conv2D", "config": {"name": "decoder_stage1b_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage1a_relu", 0, 0, {}]]]}, {"name": "decoder_stage1b_bn", "class_name": "BatchNormalization", "config": {"name": "decoder_stage1b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage1b_conv", 0, 0, {}]]]}, {"name": "decoder_stage1b_relu", "class_name": "Activation", "config": {"name": "decoder_stage1b_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["decoder_stage1b_bn", 0, 0, {}]]]}, {"name": "decoder_stage2_upsampling", "class_name": "UpSampling2D", "config": {"name": "decoder_stage2_upsampling", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["decoder_stage1b_relu", 0, 0, {}]]]}, {"name": "decoder_stage2_concat", "class_name": "Concatenate", "config": {"name": "decoder_stage2_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["decoder_stage2_upsampling", 0, 0, {}], ["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "decoder_stage2a_conv", "class_name": "Conv2D", "config": {"name": "decoder_stage2a_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_stage2_concat", 0, 0, {}]]]}, {"name": "decoder_stage2a_bn", "class_name": "BatchNormalization", "config": {"name": "decoder_stage2a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["decoder_stage2a_conv", 0, 0, {}]]]}, {"name": "decoder_stage2a_relu", "class_name": "Activation", "config": {"name": "decoder_stage2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["decoder_stage2a_bn", 0, 0, {}]]]}, {"name": "decoder_stage2b_conv", "class_name": "Conv2D", "config": {"name": "decoder_stage2b_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, 